In [ ]:
import pandas as pd  
  
info = {'one' : pd.Series([1, 2, 3, 4, 5, 6], index=['a', 'b', 'c', 'd', 'e', 'f']),  
   'two' : pd.Series([11, 21, 32, 43, 52, 64, 73, 81], index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])}  
  
d1 = pd.DataFrame(info)
print(d1)
print("Adding new dataframe by passing series") 
d1['three'] = pd.Series([1,2,3],index=['a','b','c']) 
print (d1)  
print("Adding new row using DataFrame")
d1['four'] = d1['one']+d1['two']
print(d1)

   one  two
a  1.0   11
b  2.0   21
c  3.0   32
d  4.0   43
e  5.0   52
f  6.0   64
g  NaN   73
h  NaN   81
Adding new dataframe by passing series
   one  two  three
a  1.0   11    1.0
b  2.0   21    2.0
c  3.0   32    3.0
d  4.0   43    NaN
e  5.0   52    NaN
f  6.0   64    NaN
g  NaN   73    NaN
h  NaN   81    NaN
Adding new row using DataFrame
   one  two  three  four
a  1.0   11    1.0  12.0
b  2.0   21    2.0  23.0
c  3.0   32    3.0  35.0
d  4.0   43    NaN  47.0
e  5.0   52    NaN  57.0
f  6.0   64    NaN  70.0
g  NaN   73    NaN   NaN
h  NaN   81    NaN   NaN

In [ ]:
import pandas as pd
stu_roll = {'Roll':[701,704,705,706,707],
            'Name':['Sayantan','Debpritam','Alapan','Sawan','Mama'],
            'SGPA':[9.1,9.4,9.5,9.9,9.2]}
details = pd.DataFrame(stu_roll)
print(details)

   Roll       Name  SGPA
0   701   Sayantan   9.1
1   704  Debpritam   9.4
2   705     Alapan   9.5
3   706      Sawan   9.9
4   707       Mama   9.2

In [ ]:
import pandas as pd
info1 = pd.DataFrame({"x":[10,20,30,40],"y":[40,30,20,10]})
info2 = pd.DataFrame({"x":[10,20,30,40],"y":[40,30,20,10],"z":[25,15,23,26]})
info1.append(info2,ignore_index = True)

    x   y     z
0  10  40   NaN
1  20  30   NaN
2  30  20   NaN
3  40  10   NaN
4  10  40  25.0
5  20  30  15.0
6  30  20  23.0
7  40  10  26.0

In [ ]:
import pandas as pd
info1 = pd.DataFrame({"x":[10,20,30,40],"y":[40,30,20,10]})
info2 = pd.DataFrame({"x":[10,20,30,40],"y":[40,30,20,10],"z":[25,15,23,26]})
print(info1,"\n")
info2
info1.append(info2)
info1.append(info2,ignore_index = True)

    x   y
0  10  40
1  20  30
2  30  20
3  40  10

    x   y     z
0  10  40   NaN
1  20  30   NaN
2  30  20   NaN
3  40  10   NaN
4  10  40  25.0
5  20  30  15.0
6  30  20  23.0
7  40  10  26.0

In [ ]:
import pandas as pd
info1 = pd.DataFrame({"x":[1,2,3,4,5,6,7,8,9],"index1":['a','b','c','d','e','f','g','h','i']})
info2 = pd.DataFrame({"x":[1,2,3,4,5,6,7],"index2":['a','b','c','d','e','f','g']})
print(info1,"\n")
info2
info1.append(info2)
info1.append(info2,ignore_index = True)

   x index1
0  1      a
1  2      b
2  3      c
3  4      d
4  5      e
5  6      f
6  7      g
7  8      h
8  9      i

    x index1 index2
0   1      a    NaN
1   2      b    NaN
2   3      c    NaN
3   4      d    NaN
4   5      e    NaN
5   6      f    NaN
6   7      g    NaN
7   8      h    NaN
8   9      i    NaN
9   1    NaN      a
10  2    NaN      b
11  3    NaN      c
12  4    NaN      d
13  5    NaN      e
14  6    NaN      f
15  7    NaN      g

In [ ]:
import pandas as pd
axis1 = pd.DataFrame([[2,9],[4,5],[7,8]],columns = ['x','y'])
axis2 = pd.DataFrame([[1,7],[3,5],[6,10]],columns = ['x','y'])
#axis1.append(axis2,ignore_index=True)
#axis1.drop(0)
#axis2
print(axis1)

   x  y
0  2  9
1  4  5
2  7  8

In [ ]:
import pandas as pd
import numpy as np
info = pd.DataFrame([[2,8]]*4,columns = ['x','y'])
#info.apply(np.sqrt)
#info.apply(np.sum,axis =0)
info.apply(np.sum,axis =1)
#info

0    10
1    10
2    10
3    10
dtype: int64

In [ ]:
import pandas as pd
#import numpy as np
info = pd.DataFrame([[10,21,32,45],[4,2,45,37]],columns = ['x','y','z','p'])
info.agg(['min','sum'])
#info

      x   y   z   p
min   4   2  32  37
sum  14  23  77  82

In [ ]:
import pandas as pd
info = pd.DataFrame()
info
info['ID'] = [701,702,703,704,705]
info
info.assign(Name = ['Artira','Sourojit','Anik','Ankit','Ram'])
info
info.assign(Marks = [90,92,80,99,100])
info.agg('min')

ID    701
dtype: int64

In [ ]:
import pandas as pd
import numpy as np
info = pd.DataFrame({'Name':('XU','RKMVU','RKMVCC','Narendrapur','Bethun','Presidency'),
                      'Rankings':(4,5,15,21,np.nan,np.nan)})
info.count()
info.count(axis = 'columns')
#info

0    2
1    2
2    2
3    2
4    1
5    1
dtype: int64

In [ ]:
import pandas as pd  
import numpy as np  
info_nums = pd.DataFrame({'num': np.random.randint(1, 50, 11)})  
print(info_nums) 

info_nums['num_bins'] = pd.cut(x=info_nums['num'], bins=[1, 25, 50])  
print(info_nums)  
print(info_nums['num_bins'].unique())

    num
0    12
1    35
2    30
3    34
4    49
5     6
6    42
7    48
8    42
9     5
10   19
    num  num_bins
0    12   (1, 25]
1    35  (25, 50]
2    30  (25, 50]
3    34  (25, 50]
4    49  (25, 50]
5     6   (1, 25]
6    42  (25, 50]
7    48  (25, 50]
8    42  (25, 50]
9     5   (1, 25]
10   19   (1, 25]
[(1, 25], (25, 50]]
Categories (2, interval[int64, right]): [(1, 25] < (25, 50]]

In [ ]:
import pandas as pd  
import numpy as np  
info_nums = pd.DataFrame({'num': np.random.randint(1, 10, 7)})  
print(info_nums)  
info_nums['nums_labels'] = pd.cut(x=info_nums['num'], bins=[1, 4, 10], labels=['Low', 'High'],right=True)  
print(info_nums)  
print(info_nums['nums_labels'].unique())

   num
0    7
1    8
2    6
3    7
4    4
5    7
6    3
   num nums_labels
0    7        High
1    8        High
2    6        High
3    7        High
4    4         Low
5    7        High
6    3         Low
['High', 'Low']
Categories (2, object): ['Low' < 'High']

In [ ]:
    #Describing the data
import pandas as pd  
import numpy as np  
a1 = pd.Series([1, 2, 3])  
a1.describe()  
a1 = pd.Series(['p', 'q', 'q', 'r'])  
a1.describe()  
info = pd.DataFrame({'categorical': pd.Categorical(['u','v','w']),  
    'numeric': [1, 2, 3],  
    'object': ['p', 'q', 'r']  
     })  
info.describe(include=[np.number])  
info.describe(include=[np.object])  
info.describe(include=['category'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:13: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  del sys.path[0]

       categorical
count            3
unique           3
top              u
freq             1

In [ ]:
#Removing Duplicates
import pandas as pd
info = pd.DataFrame({"Name":["Alapan","Venky","Venky","Harish"],"Age":[21,31,31,41]})
info
info.drop_duplicates()
#data = pd.DataFrame(info)
#data

     Name  Age
0  Alapan   21
1   Venky   31
3  Harish   41

In [ ]:
import pandas as pd
import numpy as np
friends = pd.DataFrame({"Name":["Alapan","Venkatesh","Arkajeet","Srijit"],
                        "Course":["Phd","MSc","Bsc","Btech"],
                        "Location":["Seorapully","Patna","Dumdum","Shyamnagar"]})
friends
group = friends.groupby("Location")
print(group['Course'].agg([min]))

              min
Location
Dumdum        Bsc
Patna         MSc
Seorapully    Phd
Shyamnagar  Btech

In [ ]:
import pandas as pd
friends = pd.DataFrame({"Name":["Alapan","Venkatesh","Arkajeet","Srijit"],
                        "Course":["Phd","MSc","Bsc","Btech"],
                        "Location":["Seorapully","Patna","Dumdum","Shyamnagar"]})
friends
group = friends.groupby("Location")
print(group['Course'].filter(lambda x : len(x)<=1))

0      Phd
1      MSc
2      Bsc
3    Btech
Name: Course, dtype: object

In [ ]:
import pandas as pd
info = pd.DataFrame({'Language':["Python","C","C++","Java"],"Rankings":[1,2,3,4]})
info
info.head()
#info.head(2)

  Language  Rankings
0   Python         1
1        C         2
2      C++         3
3     Java         4

In [ ]:
import pandas as pd
data1 = pd.DataFrame({'id':[701,704,712],'Location':["Midnapore","Hooghly","Ghatal"],'SGPA':[8.95,9.5,9.08]})
data2 = pd.DataFrame({'id':[703,705,716],'Location':["Hooghly","Chittaranjan","Assam"],'SGPA':[9.05,9.3,8.55]})
print(data1)
print(data2)

    id   Location  SGPA
0  701  Midnapore  8.95
1  704    Hooghly  9.50
2  712     Ghatal  9.08
    id      Location  SGPA
0  703       Hooghly  9.05
1  705  Chittaranjan  9.30
2  716         Assam  8.55